art_share_api_project/app/controllers/artwork_shares_controller.rb

    def destroy
        @artwork_share = ArtworkShare.find(params[:id])
        removed = @artwork_share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 1]]