art_share_api_project/app/controllers/artworks_controller.rb

    def index
        @artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks"

    def show
        # render json: params
        @artwork = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]