art_share_api_project/app/controllers/users_controller.rb

    def create
        # render json: params
        user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "'Jonathan Zhou'"], ["email", "jzhou@google.com"], ["created_at", "2022-06-29 20:31:01.748976"], ["updated_at", "2022-06-29 20:31:01.748976"]]

    def show
        # render json: params
        @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def update
        # debugger
        @user = User.find(params[:id])
        if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Kyle"], ["updated_at", "2022-06-29 22:14:08.131458"], ["id", 3]]